Repository: xcv58/MacTools
Catalog: Plugins/IPOverview/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# service.error.noPublicIP
source: 未能从外部检测源获取公网 IP
ar: تعذر الحصول على عنوان IP عام من مصادر خارجية
de: Es konnte keine öffentliche IP von externen Quellen abgerufen werden
en: Could not get a public IP from external sources
es: No se pudo obtener una IP pública de fuentes externas
fr: Impossible d'obtenir une adresse IP publique à partir de sources externes
ja: 外部ソースからパブリック IP を取得できませんでした
ko: 외부 소스에서 공용 IP를 얻을 수 없습니다
pt: Não foi possível obter um IP público de fontes externas
ru: Не удалось получить публичный IP из внешних источников
tr: Dış kaynaklardan genel IP alınamadı
zh_hant: 未能從外部檢測源獲取公網 IP

# status.checking
source: 检测中
ar: التحقق
de: Prüfung
en: Checking
es: Comprobación
fr: Vérification
ja: チェック中
ko: 확인 중
pt: Verificando
ru: Проверка
tr: Kontrol ediliyor
zh_hant: 檢測中

# status.waiting
source: 等待检测
ar: الانتظار
de: Warten
en: Waiting
es: Esperando
fr: En attente
ja: 待機中
ko: 대기 중
pt: Esperando
ru: Ожидание
tr: Bekliyor
zh_hant: 等待檢測

# stun.error.invalidPort
source: STUN 端口无效
ar: منفذ STUN غير صالح
de: Ungültiger STUN-Port
en: Invalid STUN port
es: Puerto STUN no válido
fr: Port STUN invalide
ja: 無効な STUN ポート
ko: 잘못된 STUN 포트
pt: Porta STUN inválida
ru: Неверный порт STUN
tr: Geçersiz STUN bağlantı noktası
zh_hant: STUN 端口無效

# stun.error.noMappedAddress
source: 未返回外部地址
ar: لم يتم إرجاع أي عنوان خارجي
de: Keine externe Adresse zurückgegeben
en: No external address returned
es: No se devolvió ninguna dirección externa
fr: Aucune adresse externe renvoyée
ja: 外部アドレスが返されません
ko: 외부 주소가 반환되지 않았습니다
pt: Nenhum endereço externo retornado
ru: Внешний адрес не возвращен
tr: Dış adres döndürülmedi

# stun.error.timedOut
source: STUN 请求超时
ar: انتهت مهلة طلب STUN
de: Zeitüberschreitung der STUN-Anfrage
en: STUN request timed out
es: Se agotó el tiempo de espera de la solicitud STUN
fr: La requête STUN a expiré
ja: STUN リクエストがタイムアウトしました
ko: STUN 요청 시간 초과
pt: A solicitação STUN expirou
ru: Тайм-аут запроса STUN
tr: STUN isteği zaman aşımına uğradı
zh_hant: STUN 請求超時

# webrtc.note
source: WebRTC 往往通过 UDP 直连进行建立，如果测试返回了真实 IP，则意味着你的代理设置没有覆盖这些连接。除了检测你连接 WebRTC 时所使用的 IP，我们还会检测你的 NAT 类型。然而，NAT 类型的检测并非完全准确，仅供参考。
ar: ينشئ WebRTC غالبًا اتصالات UDP مباشرة. إذا أعاد هذا الاختبار عنوان IP الحقيقي، فهذا يعني أن إعدادات الوكيل لديك لا تغطي تلك الاتصالات. بالإضافة إلى التحقق من عنوان IP المستخدم لـ WebRTC، يتحقق الاختبار من نوع NAT لديك. اكتشاف NAT ليس دقيقًا بالكامل وهو للمرجع فقط.
de: WebRTC baut häufig direkte UDP-Verbindungen auf. Wenn dieser Test Ihre echte IP zurückgibt, decken Ihre Proxy-Einstellungen diese Verbindungen nicht ab. Zusätzlich zur IP, die WebRTC verwendet, wird auch Ihr NAT-Typ geprüft. Die NAT-Erkennung ist nicht vollständig genau und dient nur als Referenz.
en: WebRTC often establishes direct UDP connections. If this test returns your real IP, your proxy settings are not covering those connections. In addition to checking the IP used for WebRTC, it also checks your NAT type. NAT detection is not fully accurate and is only for reference.
es: WebRTC suele establecer conexiones UDP directas. Si esta prueba devuelve tu IP real, la configuración del proxy no cubre esas conexiones. Además de comprobar la IP usada por WebRTC, también comprueba tu tipo de NAT. La detección de NAT no es completamente exacta y solo sirve como referencia.
fr: WebRTC établit souvent des connexions UDP directes. Si ce test renvoie votre véritable adresse IP, vos paramètres proxy ne couvrent pas ces connexions. En plus de vérifier l'adresse IP utilisée par WebRTC, il vérifie aussi votre type de NAT. La détection du NAT n'est pas totalement précise et n'est fournie qu'à titre indicatif.
ja: WebRTC は直接 UDP 接続を確立することがあります。このテストで実際の IP が返る場合、プロキシ設定がそれらの接続をカバーしていません。WebRTC が使用する IP に加えて、NAT タイプも確認します。NAT タイプの検出は完全には正確ではなく、参考情報です。
ko: WebRTC는 직접 UDP 연결을 만드는 경우가 많습니다. 이 테스트에서 실제 IP가 반환되면 프록시 설정이 해당 연결을 포함하지 않는 것입니다. WebRTC에서 사용하는 IP와 함께 NAT 유형도 확인합니다. NAT 감지는 완전히 정확하지 않으며 참고용입니다.
pt: O WebRTC costuma estabelecer conexões UDP diretas. Se este teste retornar seu IP real, as configurações de proxy não estão cobrindo essas conexões. Além de verificar o IP usado pelo WebRTC, ele também verifica o tipo de NAT. A detecção de NAT não é totalmente precisa e serve apenas como referência.
ru: WebRTC часто устанавливает прямые UDP-соединения. Если тест возвращает ваш реальный IP, настройки прокси не покрывают эти соединения. Помимо IP, используемого WebRTC, проверяется и тип NAT. Определение NAT не является полностью точным и приведено только для справки.
tr: WebRTC çoğu zaman doğrudan UDP bağlantıları kurar. Bu test gerçek IP'nizi döndürürse vekil sunucu ayarlarınız bu bağlantıları kapsamıyordur. WebRTC'de kullanılan IP'nin yanı sıra NAT türünüz de kontrol edilir. NAT algılama tam olarak doğru değildir ve yalnızca bilgi amaçlıdır.
zh_hant: WebRTC 往往通過 UDP 直連進行建立，如果測試返回了真實 IP，則意味着你的代理設定沒有覆蓋這些連接。除了檢測你連接 WebRTC 時所使用的 IP，我們還會檢測你的 NAT 類型。然而，NAT 類型的檢測並非完全準確，僅供參考。

# webrtc.title
source: WebRTC 泄露测试
ar: اختبار تسرب WebRTC
de: WebRTC-Lecktest
en: WebRTC Leak Test
es: Prueba de fuga WebRTC
fr: Test de fuite WebRTC
ja: WebRTC リークテスト
ko: WebRTC 누출 테스트
pt: Teste de vazamento WebRTC
ru: Проверка утечки WebRTC
tr: WebRTC Sızıntı Testi
zh_hant: WebRTC 泄露測試

# common.refresh
source: 刷新
ar: تحديث
de: Aktualisieren
en: Refresh
es: Actualizar
fr: Actualiser
ja: リフレッシュ
ko: 새로고침
pt: Atualizar
ru: Обновить
tr: Yenile

# copy.ip.help
source: 复制 %@ IP
ar: انسخ %@ IP
de: Kopiere %@ IP
en: Copy %@ IP
es: Copiar %@ IP
fr: Copier %@ IP
ja: %@ IP をコピー
ko: %@ IP 복사
pt: Copiar %@ IP
ru: Копировать %@ IP
tr: %@ IP'yi kopyala
zh_hant: 複製 %@ IP

# copy.leakEndpoint.help
source: 复制出口 IP
ar: نسخ عنوان IP للخروج
de: Ausgangs-IP kopieren
en: Copy egress IP
es: Copiar IP de salida
fr: Copier l'adresse IP de sortie
ja: 出力 IP をコピー
ko: 송신 IP 복사
pt: Copiar IP de saída
ru: Копировать исходящий IP
tr: Çıkış IP'sini kopyala
zh_hant: 複製出口 IP

# detail.copyReport
source: 复制结果
ar: نسخ النتيجة
de: Ergebnis kopieren
en: Copy Result
es: Copiar resultado
fr: Copier le résultat
ja: 結果をコピー
ko: 결과 복사
pt: Copiar resultado
ru: Копировать результат
tr: Sonucu Kopyala
zh_hant: 複製結果

# detail.refresh
source: 检测
ar: تحقق
de: Überprüfen
en: Check
es: Comprobar
fr: Vérifier
ja: チェック
ko: 확인
pt: Verificar
ru: Проверить
tr: Kontrol Et
zh_hant: 檢測

# detail.refreshing
source: 检测中
ar: التحقق
de: Prüfung
en: Checking
es: Comprobación
fr: Vérification
ja: チェック中
ko: 확인 중
pt: Verificando
ru: Проверка
tr: Kontrol ediliyor
zh_hant: 檢測中

# dns.assessment.checking
source: 正在检测 DNS
ar: التحقق من DNS
de: DNS überprüfen
en: Checking DNS
es: Comprobando DNS
fr: Vérification du DNS
ja: DNS をチェックしています
ko: DNS 확인
pt: Verificando DNS
ru: Проверка DNS
tr: DNS kontrol ediliyor
zh_hant: 正在檢測 DNS

# dns.assessment.clear
source: 未发现 DNS 泄露
ar: لم يتم العثور على تسرب DNS
de: Kein DNS-Leck gefunden
en: No DNS leak found
es: No se encontró ninguna fuga de DNS
fr: Aucune fuite DNS trouvée
ja: DNS リークは見つかりませんでした
ko: DNS 누출이 발견되지 않았습니다
pt: Nenhum vazamento de DNS encontrado
ru: Утечки DNS не обнаружено
tr: DNS sızıntısı bulunamadı
zh_hant: 未發現 DNS 泄露

# dns.assessment.unknown
source: DNS 结果不完整
ar: نتيجة DNS غير مكتملة
de: DNS-Ergebnis unvollständig
en: DNS result incomplete
es: Resultado de DNS incompleto
fr: Résultat DNS incomplet
ja: DNS 結果が不完全
ko: DNS 결과가 불완전합니다
pt: Resultado de DNS incompleto
ru: Результат DNS неполный
tr: DNS sonucu eksik
zh_hant: DNS 結果不完整

# dns.assessment.waiting
source: 等待 DNS 检测
ar: في انتظار فحص DNS
de: Warten auf DNS-Prüfung
en: Waiting for DNS check
es: Esperando comprobación de DNS
fr: En attente de vérification DNS
ja: DNS チェックを待機中
ko: DNS 확인을 기다리는 중
pt: Aguardando verificação de DNS
ru: Ожидание проверки DNS
tr: DNS kontrolü bekleniyor
zh_hant: 等待 DNS 檢測

# dns.assessment.warning
source: 可能存在 DNS 泄露
ar: تسرب DNS محتمل
de: Mögliches DNS-Leck
en: Possible DNS leak
es: Posible fuga de DNS
fr: Fuite DNS possible
ja: DNS リークの可能性
ko: DNS 유출 가능성
pt: Possível vazamento de DNS
ru: Возможная утечка DNS
tr: Olası DNS sızıntısı

# egress.domestic
source: 国内出口
ar: الخروج المحلي
de: Inländischer Ausgang
en: Domestic egress
es: Salida nacional
fr: Sortie nationale
ko: 국내 출구
pt: Saída nacional
ru: Внутренний выход
tr: Yurt içi çıkış
zh_hant: 國內出口

# egress.international
source: 国际出口
ar: الخروج الدولي
de: Internationaler Ausgang
en: International egress
es: Salida internacional
fr: Sortie internationale
ja: 国際出口
ko: 국제 출구
pt: Saída internacional
ru: Международный выход
tr: Uluslararası çıkış
zh_hant: 國際出口

# info.isp
source: 运营商
ar: مزود خدمة الإنترنت
de: ISP
en: ISP
es: ISP
fr: FAI
ja: ISP
ko: ISP
pt: ISP
ru: Интернет-провайдер
tr: İSS
zh_hant: 運營商

# info.location
source: 位置
ar: الموقع
de: Standort
en: Location
es: Ubicación
fr: Emplacement
ja: 場所
ko: 위치
pt: Localização
ru: Местоположение
tr: Konum

# landing.domestic
source: 国内出口
ar: محلي
de: Inland
en: Domestic
es: Nacional
fr: Domestique
ja: 国内
ko: 국내
pt: Doméstico
ru: Внутренний
tr: Yurt içi
zh_hant: 國內出口

# landing.international
source: 国际出口
ar: دولية
de: International
en: International
es: Internacional
fr: International
ja: 国際
ko: 국제
pt: Internacional
ru: Международный
tr: Uluslararası
zh_hant: 國際出口

# leak.badge.checking
source: 检测中
ar: التحقق
de: Prüfung
en: Checking
es: Comprobación
fr: Vérification
ja: チェック中
ko: 확인 중
pt: Verificando
ru: Проверка
tr: Kontrol ediliyor
zh_hant: 檢測中

# leak.badge.clear
source: 通过
ar: ناجح
de: Bestanden
en: Passed
es: Aprobado
fr: Réussi
ja: 合格
ko: 통과
pt: Aprovado
ru: Пройдено
tr: Geçti
zh_hant: 通過

# leak.badge.unknown
source: 无法判断
ar: غير معروف
de: Unbekannt
en: Unknown
es: Desconocido
fr: Inconnu
ja: 不明
ko: 알 수 없음
pt: Desconhecido
ru: Неизвестно
tr: Bilinmiyor
zh_hant: 無法判斷

# leak.badge.waiting
source: 待检测
ar: الانتظار
de: Warten
en: Waiting
es: Esperando
fr: En attente
ja: 待機中
ko: 대기 중
pt: Esperando
ru: Ожидание
tr: Bekliyor
zh_hant: 待檢測

# leak.badge.warning
source: 注意
ar: انتباه
de: Achtung
en: Attention
es: Atención
fr: Attention
ko: 주의
pt: Atenção
ru: Внимание
tr: Dikkat

# leak.details.help
source: 查看检测详情
ar: عرض تفاصيل الفحص
de: Prüfdetails anzeigen
en: View check details
es: Ver detalles de la comprobación
fr: Afficher les détails de la vérification
ja: チェック詳細を表示
ko: 확인 세부정보 보기
pt: Ver detalhes da verificação
ru: Просмотреть сведения о проверке
tr: Kontrol ayrıntılarını görüntüle
zh_hant: 查看檢測詳情

# leak.details.title
source: 检测详情
ar: تفاصيل الفحص
de: Prüfdetails
en: Check Details
es: Detalles de la comprobación
fr: Détails de la vérification
ja: チェック詳細
ko: 확인 세부정보
pt: Verificar detalhes
ru: Сведения о проверке
tr: Kontrol Ayrıntıları
zh_hant: 檢測詳情

# leak.evidence.count
source: %d/%d 个节点有结果
ar: %d/%d العقد التي تم الإبلاغ عنها
de: %d/%d Knoten gemeldet
en: %d/%d nodes reported
es: %d/%d nodos reportados
fr: Nœuds %d/%d signalés
ja: %d/%d ノードが報告されました
ko: %d/%d 노드가 보고됨
pt: %d/%d nós relatados
ru: Сообщено об узлах %d/%d
tr: %d/%d düğüm sonuç bildirdi
zh_hant: %d/%d 個節點有結果

# leak.observed
source: 已获取
ar: تمت ملاحظته
de: Beobachtet
en: Observed
es: Observado
fr: Observé
ja: 観測済み
ko: 관찰
pt: Observado
ru: Замечено
tr: Gözlemlenen
zh_hant: 已獲取

# leak.reason.checking
source: 正在收集各节点返回的出口信息。
ar: جمع معلومات الخروج التي يتم إرجاعها بواسطة كل عقدة.
de: Sammeln der von jedem Knoten zurückgegebenen Ausgangsinformationen.
en: Collecting egress information returned by each node.
es: Recopilación de información de salida devuelta por cada nodo.
fr: Collecte des informations de sortie renvoyées par chaque nœud.
ja: 各ノードから返された出口情報を収集しています。
ko: 각 노드에서 반환된 송신 정보를 수집합니다.
pt: Coletando informações de saída retornadas por cada nó.
ru: Сбор исходящей информации, возвращаемой каждым узлом.
tr: Her düğümün döndürdüğü çıkış bilgileri toplanıyor.
zh_hant: 正在收集各節點返回的出口信息。

# leak.reason.dnsDifferentEgressRegion
source: DNS 解析器出口地区与当前公网出口不一致。
ar: تختلف منطقة محلل DNS عن منطقة عنوان IP العام الحالي.
de: Die DNS-Resolver-Region unterscheidet sich vom aktuellen öffentlichen Ausgang.
en: The DNS resolver region differs from the current public egress.
es: La región del resolutor DNS difiere de la región de la IP pública actual.
fr: La région du résolveur DNS diffère de celle de l'IP publique actuelle.
ja: DNS リゾルバーの地域が現在のパブリック IP の地域と異なります。
ko: DNS 리졸버 지역이 현재 공인 IP 지역과 다릅니다.
pt: A região do resolvedor DNS é diferente da saída pública atual.
ru: Регион DNS-резолвера отличается от региона текущего публичного IP.
tr: DNS çözümleyicisinin bölgesi, geçerli genel çıkıştan farklı.
zh_hant: DNS 解析器出口地區與當前公網出口不一致。

# leak.reason.dnsMatchesEgressRegion
source: DNS 解析器出口地区与当前公网出口一致。
ar: تطابق منطقة محلل DNS منطقة عنوان IP العام الحالي.
de: Die DNS-Resolver-Region entspricht dem aktuellen öffentlichen Ausgang.
en: The DNS resolver region matches the current public egress.
es: La región del resolutor DNS coincide con la región de la IP pública actual.
fr: La région du résolveur DNS correspond à celle de l'IP publique actuelle.
ja: DNS リゾルバーの地域が現在のパブリック IP の地域と一致します。
ko: DNS 리졸버 지역이 현재 공인 IP 지역과 일치합니다.
pt: A região do resolvedor DNS corresponde à saída pública atual.
ru: Регион DNS-резолвера совпадает с регионом текущего публичного IP.
tr: DNS çözümleyicisinin bölgesi, geçerli genel çıkışla eşleşiyor.
zh_hant: DNS 解析器出口地區與當前公網出口一致。

# leak.reason.dnsObservedWithoutBaselineRegion
source: 已获取 DNS 出口，但公网归属地不足，暂时无法对照。
ar: تم العثور على مخرج DNS، لكن بيانات الموقع العامة غير كافية للمقارنة.
de: DNS-Ausgangsdaten wurden gefunden, aber die öffentlichen Standortdaten reichen für einen Vergleich nicht aus.
en: DNS egress was found, but public location data is insufficient for comparison.
es: Se encontró salida de DNS, pero los datos de ubicación pública no son suficientes para comparar.
fr: Une sortie DNS a été trouvée, mais les données de localisation publique sont insuffisantes pour permettre une comparaison.
ja: DNS 出口は取得できましたが、比較に必要なパブリック IP の所在地情報が不足しています。
ko: DNS 출구는 확인했지만 비교할 공인 IP 위치 데이터가 부족합니다.
pt: A saída de DNS foi encontrada, mas os dados de localização pública são insuficientes para comparação.
ru: DNS-выход найден, но данных о местоположении публичного IP недостаточно для сравнения.
tr: DNS çıkışı bulundu, ancak karşılaştırma için genel konum verileri yeterli değil.
zh_hant: 已獲取 DNS 出口，但公網歸屬地不足，暫時無法對照。

# leak.reason.noDNSEndpoint
source: 没有获取到 DNS 解析器出口，可能被网络或服务拦截。
ar: لم يتم العثور على مخرج لمحلل DNS؛ ربما تقوم الشبكة أو الخدمة بحظره.
de: Kein DNS-Resolver-Ausgang gefunden; das Netzwerk oder der Dienst blockiert ihn möglicherweise.
en: No DNS resolver egress was found; the network or service may be blocking it.
es: No se encontró ninguna salida del resolutor DNS; puede que la red o el servicio la estén bloqueando.
fr: Aucune sortie du résolveur DNS n’a été trouvée ; le réseau ou le service peut le bloquer.
ja: DNS リゾルバーの出口が見つかりません。ネットワークまたはサービスでブロックされている可能性があります。
ko: DNS 확인자 송신을 찾을 수 없습니다. 네트워크나 서비스가 이를 차단하고 있을 수 있습니다.
pt: Nenhuma saída do resolvedor DNS foi encontrada; a rede ou serviço pode estar bloqueando.
ru: Выходной канал DNS-преобразователя не найден; сеть или служба могут блокировать его.
tr: DNS çözümleyici çıkışı bulunamadı; ağ veya servis bunu engelliyor olabilir.
zh_hant: 沒有獲取到 DNS 解析器出口，可能被網絡或服務攔截。

# leak.reason.noPublicIP
source: 当前公网 IP 未获取完成，暂时无法建立对照。
ar: عنوان IP العام الحالي ليس جاهزًا، لذا لا يوجد خط أساس بعد.
de: Die aktuelle öffentliche IP ist noch nicht bereit, daher gibt es noch keine Basislinie.
en: Current public IP is not ready, so there is no baseline yet.
es: La IP pública actual no está lista, por lo que aún no existe una línea de base.
fr: L'adresse IP publique actuelle n'est pas prête, il n'y a donc pas encore de référence.
ja: 現在のパブリック IP の準備ができていないため、ベースラインはまだありません。
ko: 현재 공용 IP가 준비되지 않아 아직 기준이 없습니다.
pt: O IP público atual não está pronto, portanto ainda não há uma linha de base.
ru: Текущий публичный IP еще не готов, поэтому базовая точка пока недоступна.
tr: Geçerli genel IP henüz hazır değil; bu nedenle karşılaştırma tabanı da yok.
zh_hant: 當前公網 IP 未獲取完成，暫時無法建立對照。

# leak.reason.waiting
source: 点击刷新后会检测出口是否和当前公网信息一致。
ar: قم بالتحديث للتحقق مما إذا كان الخروج المرئي يطابق عنوان IP العام الحالي.
de: Aktualisieren Sie, um zu prüfen, ob der sichtbare ausgehende Traffic mit der aktuellen öffentlichen IP übereinstimmt.
en: Refresh to check whether visible egress matches the current public IP.
es: Actualice para comprobar si la salida visible coincide con la IP pública actual.
fr: Actualisez pour vérifier si la sortie visible correspond à l'adresse IP publique actuelle.
ja: 更新して、見えている出口が現在のパブリック IP と一致するか確認します。
ko: 새로 고침하여 표시되는 송신이 현재 공용 IP와 일치하는지 확인하세요.
pt: Atualize para verificar se a saída visível corresponde ao IP público atual.
ru: Обновите, чтобы проверить, соответствует ли видимый выход текущему публичному IP.
tr: Görünür çıkışın geçerli genel IP ile eşleşip eşleşmediğini kontrol etmek için yenileyin.
zh_hant: 點擊刷新後會檢測出口是否和當前公網信息一致。

# leak.reason.webRTCDifferentIP
source: STUN 返回了不同于当前公网 IP 的出口。
ar: أرجعت STUN عنوان IP للخروج مختلفًا عن عنوان IP العام الحالي.
de: STUN hat eine Ausgangs-IP zurückgegeben, die sich von der aktuellen öffentlichen IP unterscheidet.
en: STUN returned an egress IP different from the current public IP.
es: STUN devolvió una IP de salida diferente de la IP pública actual.
fr: STUN a renvoyé une adresse IP de sortie différente de l'adresse IP publique actuelle.
ja: STUN が現在のパブリック IP とは異なる出口 IP を返しました。
ko: STUN이 현재 공용 IP와 다른 송신 IP를 반환했습니다.
pt: STUN retornou um IP de saída diferente do IP público atual.
ru: STUN вернул выходной IP, отличный от текущего публичного IP.
tr: STUN, geçerli genel IP'den farklı bir çıkış IP'si döndürdü.
zh_hant: STUN 返回了不同於當前公網 IP 的出口。

# leak.reason.webRTCMatchesPublicIP
source: STUN 返回的出口与当前公网 IP 一致。
ar: يتطابق مخرج STUN مع عنوان IP العام الحالي.
de: Der STUN-Ausgang stimmt mit der aktuellen öffentlichen IP überein.
en: The STUN egress matches the current public IP.
es: La salida de STUN coincide con la IP pública actual.
fr: La sortie STUN correspond à l'adresse IP publique actuelle.
ja: STUN の出口が現在のパブリック IP と一致しています。
ko: STUN 송신은 현재 공용 IP와 일치합니다.
pt: A saída STUN corresponde ao IP público atual.
ru: Выход STUN совпадает с текущим публичным IP.
tr: STUN çıkışı, geçerli genel IP ile eşleşiyor.
zh_hant: STUN 返回的出口與當前公網 IP 一致。

# leak.reason.webRTCNoVisibleEndpoint
source: 未检测到 WebRTC 可见出口，通常表示 STUN 被阻断或不可达。
ar: لم يتم العثور على مخرج WebRTC مرئي؛ قد يكون STUN محظورًا أو غير قابل للوصول.
de: Es wurde kein sichtbarer WebRTC-Ausgang gefunden; STUN ist möglicherweise blockiert oder nicht erreichbar.
en: No visible WebRTC egress was found; STUN may be blocked or unreachable.
es: No se encontró ninguna salida visible de WebRTC; STUN puede estar bloqueado o ser inalcanzable.
fr: Aucune sortie WebRTC visible n'a été trouvée ; STUN peut être bloqué ou inaccessible.
ja: 表示可能な WebRTC 出口が見つかりません。STUN がブロックされているか到達できない可能性があります。
ko: 표시 가능한 WebRTC 출구를 찾을 수 없습니다. STUN이 차단되었거나 도달할 수 없을 수 있습니다.
pt: Nenhuma saída WebRTC visível foi encontrada; STUN pode estar bloqueado ou inacessível.
ru: Видимый выход WebRTC не найден; STUN может быть заблокирован или недоступен.
tr: Görünür WebRTC çıkışı bulunamadı; STUN engellenmiş veya erişilemez olabilir.
zh_hant: 未檢測到 WebRTC 可見出口，通常表示 STUN 被阻斷或不可達。

# panel.button.check
source: 检测
ar: تحقق
de: Prüfen
en: Check
es: Comprobar
fr: Vérifier
ja: チェック
ko: 확인
pt: Verificar
ru: Проверить
tr: Kontrol Et
zh_hant: 檢測

# privacy.hideIP.help
source: 隐藏 IP
ar: إخفاء عناوين IP
de: IP-Adressen ausblenden
en: Hide IP addresses
es: Ocultar direcciones IP
fr: Masquer les adresses IP
ja: IP アドレスを非表示にする
ko: IP 주소 숨기기
pt: Ocultar endereços IP
ru: Скрыть IP-адреса
tr: IP adreslerini gizle
zh_hant: 隱藏 IP

# privacy.showIP.help
source: 显示 IP
ar: إظهار عناوين IP
de: IP-Adressen anzeigen
en: Show IP addresses
es: Mostrar direcciones IP
fr: Afficher les adresses IP
ja: IP アドレスを表示
ko: IP 주소 표시
pt: Mostrar endereços IP
ru: Показать IP-адреса
tr: IP adreslerini göster
zh_hant: 顯示 IP

# publicIP.refresh.help
source: 刷新公网 IP 和归属地
ar: تحديث عنوان IP العام والموقع
de: Öffentliche IP und Standort aktualisieren
en: Refresh public IP and location
es: Actualizar IP pública y ubicación
fr: Actualiser l'adresse IP publique et l'emplacement
ja: パブリック IP と所在地を更新
ko: 공용 IP 및 위치 새로고침
pt: Atualizar IP público e localização
ru: Обновить публичный IP и местоположение
tr: Genel IP'yi ve konumu yenile
zh_hant: 刷新公網 IP 和歸屬地

# publicIP.title
source: 公网 IP
ar: عنوان IP العام
de: Öffentliche IP
en: Public IP
es: IP pública
fr: IP publique
ja: パブリック IP
ko: 공용 IP
pt: IP público
ru: Публичный IP
tr: Genel IP
zh_hant: 公網 IP

# report.domesticIPv4
source: 国内出口 IPv4：%@
ar: خروج محلي IPv4: %@
de: Inländischer Ausgang IPv4: %@
en: Domestic egress IPv4: %@
es: IPv4 de salida nacional: %@
fr: Sortie nationale IPv4 : %@
ko: 국내 송신 IPv4: %@
pt: Saída doméstica IPv4: %@
ru: Внутренний исходящий IPv4: %@
tr: Yurt içi çıkış IPv4: %@
zh_hant: 國內出口 IPv4：%@

# report.domesticIPv6
source: 国内出口 IPv6：%@
ar: خروج محلي IPv6: %@
de: Inländischer Ausgang IPv6: %@
en: Domestic egress IPv6: %@
es: IPv6 de salida nacional: %@
fr: Sortie nationale IPv6 : %@
ko: 국내 송신 IPv6: %@
pt: Saída doméstica IPv6: %@
ru: Внутренний исходящий IPv6: %@
tr: Yurt içi çıkış IPv6: %@
zh_hant: 國內出口 IPv6：%@

# speed.download
source: 下载
ar: تنزيل
de: Herunterladen
en: Download
es: Descargar
fr: Télécharger
ja: ダウンロード
ko: 다운로드
pt: Baixar
ru: Загрузить
tr: İndirme
zh_hant: 下載

# speed.duration.seconds
source: %.1f 秒
ar: %.1f ثانية
de: %.1f Sek.
en: %.1f sec
es: %.1f seg
fr: %.1f s
ko: %.1f초
pt: %.1f segundos
ru: %.1f сек
tr: %.1f sn

# speed.error.cancelled
source: 测速已取消
ar: تم إلغاء اختبار السرعة
de: Geschwindigkeitstest abgebrochen
en: Speed test cancelled
es: Prueba de velocidad cancelada
fr: Test de vitesse annulé
ja: スピードテストがキャンセルされました
ko: 속도 테스트 취소됨
pt: Teste de velocidade cancelado
ru: Проверка скорости отменена
tr: Hız testi iptal edildi
zh_hant: 測速已取消

# speed.error.failed
source: 测速失败
ar: فشل اختبار السرعة
de: Geschwindigkeitstest fehlgeschlagen
en: Speed test failed
es: La prueba de velocidad falló
fr: Échec du test de vitesse
ja: 速度テストに失敗しました
ko: 속도 테스트 실패
pt: Falha no teste de velocidade
ru: Проверка скорости не удалась
tr: Hız testi başarısız oldu
zh_hant: 測速失敗

# speed.error.invalidOutput
source: 测速结果格式不可读
ar: إخراج اختبار السرعة غير قابل للقراءة
de: Geschwindigkeitstest-Ausgabe ist nicht lesbar
en: Speed test output is not readable
es: La salida de la prueba de velocidad no es legible
fr: La sortie du test de vitesse n'est pas lisible
ja: 速度テストの出力が読み取れません
ko: 속도 테스트 출력을 읽을 수 없습니다
pt: A saída do teste de velocidade não é legível
ru: Вывод теста скорости не читается
tr: Hız testi çıktısı okunamıyor
zh_hant: 測速結果格式不可讀

# speed.error.unavailable
source: 当前系统不可用 networkQuality
ar: جودة الشبكة غير متوفرة على هذا النظام
de: networkQuality ist auf diesem System nicht verfügbar
en: networkQuality is not available on this system
es: networkQuality no está disponible en este sistema
fr: networkQuality n'est pas disponible sur ce système
ja: このシステムでは networkQuality を利用できません
ko: 이 시스템에서는 networkQuality를 사용할 수 없습니다
pt: networkQuality não está disponível neste sistema
ru: сетевое качество недоступно в этой системе
tr: Bu sistemde networkQuality kullanılamıyor
zh_hant: 當前系統不可用 networkQuality

# speed.failed.title
source: 测速失败
ar: فشل اختبار السرعة
de: Geschwindigkeitstest fehlgeschlagen
en: Speed test failed
es: La prueba de velocidad falló
fr: Le test de vitesse a échoué
ja: 速度テストに失敗しました
ko: 속도 테스트 실패
pt: Falha no teste de velocidade
ru: Проверка скорости не удалась
tr: Hız testi başarısız oldu
zh_hant: 測速失敗

# speed.grade.excellent
source: 优秀
ar: ممتاز
de: Ausgezeichnet
en: Excellent
es: Excelente
fr: Excellent
ja: 素晴らしい
ko: 훌륭함
pt: Excelente
ru: Отлично
tr: Mükemmel
zh_hant: 優秀

# speed.grade.fair
source: 一般
ar: عادل
de: Ausreichend
en: Fair
es: Justo
fr: Juste
ja: フェア
ko: 공정하다
pt: Justo
ru: Ярмарка
tr: Orta
